In [3]:
import pandas as pd

In [16]:
Cost = [100, 200]
Selling = [200,400]

In [17]:
t = {'Cost Price': Cost, 'Selling Price': Selling}

In [21]:
df = pd.DataFrame(t)

In [22]:
new_df=df.assign(R=df["Selling Price"]-df["Cost Price"])

In [23]:
new_df

   Cost Price  Selling Price    R
0         100            200  100
1         200            400  200

### Ejercicio #2 - Usando funciones lambda

In [24]:
Menu = ['Yaroa', 'Chimi', 'Pechurina']
Precio = [300, 150, 175]

In [25]:
dict_m = {'Menu': Menu,
         'Precio': Precio}

In [26]:
df_menu = pd.DataFrame(dict_m)

In [39]:
n_df = df_menu.assign(Itbis=lambda x: x.Precio * 0.05,
                          Total=lambda x: x.Precio + x.Itbis)

In [40]:
n_df

        Menu  Precio  Itbis   Total
0      Yaroa     300  15.00  315.00
1      Chimi     150   7.50  157.50
2  Pechurina     175   8.75  183.75